cf_billing/InformationRegisters/энргПриборыМОП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПриборыМОП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПриборыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПриборыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПриборыМОП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает изменяемые параметры расчета.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета		= Новый Соответствие; 
	
	ИзменяемыеПараметры 			= Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета","ПриборВведен,ДатаСостоянияПрибора"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
				
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

// Получает данные для проведения по стабильным периодам.
//
// Параметры:
//  Схема				 - 	СхемаЗапроса.
//  ВыбираемыеТаблицы	 - 	Массив.
//
Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет приборы действующих точек.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПриборыДействующихТочек(Схема, ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеТочки");
	Иначе	
		ЕстьДействующиеТочки 		= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ДействующиеТочки" Тогда
				ЕстьДействующиеТочки = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеТочки Тогда 
			РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеТочки");
		КонецЕсли;
	КонецЕсли;

	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстПриборыДействующихТочек());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	ПараметрПериод 					= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
					
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстПриборыДействующихТочек()
	
	Текст = 
	"ВЫБРАТЬ
	|	энргПриборыТочекУчетаСрезПоследних.Организация КАК Организация,
	|	энргПриборыТочекУчетаСрезПоследних.Район КАК Район,
	|	энргПриборыТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргПриборыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргПриборыТочекУчетаСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыТочекУчета
	|ИЗ
	|	РегистрСведений.энргПриборыТочекУчета.СрезПоследних(
	|			&Период,
	|			(Организация, Район, КлючПомещения, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ДействующиеТочки.Организация,
	|					ДействующиеТочки.Район,
	|					ДействующиеТочки.КлючПомещения,
	|					ДействующиеТочки.ТочкаУчета
	|				ИЗ
	|					ДействующиеТочки КАК ДействующиеТочки)) КАК энргПриборыТочекУчетаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
